fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Категория</name>
    <type>
      <types>EnumRef.ВКМ_КатегорииСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Enums/ВКМ_КатегорииСотрудников/ВКМ_КатегорииСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_КатегорииСотрудников</name>
  <enumValues>
    <name>Специалисты</name>
  </enumValues>
  <enumValues>
    <name>АдминистративныйПерсонал</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеДоступностьюПолей();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	УправлениеДоступностьюПолей();
КонецПроцедуры

&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)
	УправлениеДоступностьюПолей();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеДоступностьюПолей()
	
	Если Запись.Категория = ПредопределенноеЗначение("Перечисление.ВКМ_КатегорииСотрудников.АдминистративныйПерсонал") Тогда
		
		Если Запись.ПроцентОтРабот > 0 Тогда
			
			ТекстСообщения = "Для Административного персонала процент премии не указывается!";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Запись.ПроцентОтРабот");
			Запись.ПроцентОтРабот = 0; 
		КонецЕсли;

		Элементы.ПроцентОтРабот.Доступность = Ложь;
		
	Иначе

		Элементы.ПроцентОтРабот.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
